{
  "en": {
    "nav_home": "Home",
    "nav_about": "About",
    "nav_services": "Services",
    "nav_contact": "Contact",
    "hero_title": "Tydal Consulting",
    "hero_subtitle": "Expertise in Cloud Transformation and Automation",
    "hero_cta": "Get in Touch",
    "about_title": "About Me",
    "about_text": "Welcome to Tydal Consulting. I specialize in helping businesses leverage the power of the cloud and automation. With extensive experience across major cloud platforms and a passion for efficient, automated workflows, I provide tailored solutions to meet your unique challenges.",
    "services_title": "Services",
    "service_cloud_title": "Cloud Architecture & Solutions",
    "service_cloud_text": "Expert design and implementation on Azure (Solutions Architect Expert), with experience in AWS (Solutions Architect Associate) and GCP (Associate Cloud Engineer). Strategy, migration, and optimization.",
    "service_devops_title": "DevOps & Automation",
    "service_devops_text": "End-to-end automation using Azure DevOps (DevOps Engineer Expert), CI/CD pipelines, scripting (Bash/PowerShell), and process streamlining.",
    "service_iac_title": "Infrastructure as Code (IaC)",
    "service_iac_text": "Building scalable and manageable infrastructure using Terraform (HashiCorp Certified Associate) and Azure Bicep.",
    "service_kube_title": "Kubernetes & Cloud Native",
    "service_kube_text": "Container orchestration and management with Kubernetes (CKA & KCNA), including deployment, scaling, and administration in cloud environments.",
    "service_azure_title": "Azure Specializations",
    "service_azure_text": "Deep expertise in Azure Networking (AZ-700), Security (Security Ops, Identity, Info Protection), Administration (AZ-104), and AI/Data (AI Engineer, Power BI Analyst).",
    "service_consultancy_title": "Consultancy & Advisory",
    "service_consultancy_text": "Providing strategic guidance, best practice implementation, and technical leadership to help businesses achieve their cloud and automation goals.",
    "contact_title": "Contact",
    "contact_text": "Ready to discuss your next project? Reach out!",
    "contact_email": "Email:",
    "footer_text": "&copy; 2025 Tydal Consulting. All rights reserved."
  },
  "no": {
    "nav_home": "Hjem",
    "nav_about": "Om Meg",
    "nav_services": "Tjenester",
    "nav_contact": "Kontakt",
    "hero_title": "Tydal Consulting",
    "hero_subtitle": "Ekspertise innen Skytransformasjon og Automatisering",
    "hero_cta": "Ta Kontakt",
    "about_title": "Om Meg",
    "about_text": "Velkommen til Tydal Consulting. Jeg spesialiserer meg på å hjelpe bedrifter med å utnytte kraften i skyen og automatisering. Med omfattende erfaring på tvers av store skyplattformer og en lidenskap for effektive, automatiserte arbeidsflyter, leverer jeg skreddersydde løsninger for å møte dine unike utfordringer.",
    "services_title": "Tjenester",
    "service_cloud_title": "Skyarkitektur og Løsninger",
    "service_cloud_text": "Ekspertdesign og implementering på Azure (Solutions Architect Expert), med erfaring i AWS (Solutions Architect Associate) og GCP (Associate Cloud Engineer). Strategi, migrering og optimalisering.",
    "service_devops_title": "DevOps & Automatisering",
    "service_devops_text": "Ende-til-ende automatisering ved hjelp av Azure DevOps (DevOps Engineer Expert), CI/CD-pipelines, scripting (Bash/PowerShell) og prosessoptimalisering.",
    "service_iac_title": "Infrastruktur som Kode (IaC)",
    "service_iac_text": "Bygging av skalerbar og håndterbar infrastruktur ved hjelp av Terraform (HashiCorp Certified Associate) og Azure Bicep.",
    "service_kube_title": "Kubernetes & Cloud Native",
    "service_kube_text": "Containerorkestrering og -administrasjon med Kubernetes (CKA & KCNA), inkludert distribusjon, skalering og administrasjon i skymiljøer.",
    "service_azure_title": "Azure Spesialiseringer",
    "service_azure_text": "Dyp ekspertise innen Azure Nettverk (AZ-700), Sikkerhet (Security Ops, Identity, Info Protection), Administrasjon (AZ-104) og AI/Data (AI Engineer, Power BI Analyst).",
    "service_consultancy_title": "Rådgivning",
    "service_consultancy_text": "Tilbyr strategisk veiledning, implementering av beste praksis og teknisk ledelse for å hjelpe bedrifter med å nå sine sky- og automatiseringsmål.",
    "contact_title": "Kontakt",
    "contact_text": "Klar til å diskutere ditt neste prosjekt? Ta kontakt!",
    "contact_email": "E-post:",
    "footer_text": "&copy; 2025 Tydal Consulting. Alle rettigheter forbeholdt."
  }
}
